Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ФормаЗаказа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	Товары.Очистить();
	Дата=НаименованиеЗаказа.Дата;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказыТовары.Товар КАК Товар,
	             |	ЗаказыТовары.Количество КАК Количество
	             |ИЗ
	             |	Документ.Заказы.Товары КАК ЗаказыТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы КАК Заказы
	             |		ПО ЗаказыТовары.Ссылка = Заказы.Ссылка
	             |ГДЕ
	             |	Заказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", НаименованиеЗаказа);
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока=Товары.Добавить();
		НоваяСтрока.НаименованиеТовара=Выборка.Товар;
		НоваяСтрока.Количество=Выборка.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Строка=Товары.Получить(ВыбраннаяСтрока);
	//Форма=ПолучитьФорму("ОбщаяФорма.ФормаЗаказанногоТовара");
	//Форма.НаименованиеТовара=Строка.НаименованиеТовара;
	//Форма.Количество=Строка.Количество;
	//Форма.Открыть();
	
	Строка=Товары.Получить(ВыбраннаяСтрока);
	Форма=ПолучитьФорму("ОбщаяФорма.ФормаТовара");
	Форма.НаименованиеТовара=Строка.НаименованиеТовара;
	Форма.Открыть();
КонецПроцедуры
